of222/tutorials/rheoInterFoam/ImpactingDrop/Oldroyd-BLog/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
phase1
{
      parameters
       {		        
         type             Oldroyd-BLog;
         rho              rho [ 1 -3 0 0 0 0 0 ] 1000;
         etaS             etaS [1 -1 -1 0 0 0 0] 0.4;
         etaP             etaP [1 -1 -1 0 0 0 0] 3.6;  
         lambda           lambda [0 0 1 0 0 0 0] 0.02;
         
         uTauCoupling     true;
       }
}

phase2
{
     parameters
       {		        
         type            Newtonian;
         rho             rho [1 -3 0 0 0 0 0] 1;
         eta             eta [1 -1 -1 0 0 0 0] 1e-5; 
       }
}

passiveScalarProperties
{

                solvePassiveScalar   off;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.0;

// ************************************************************************* //
