of222/tutorials/rheoInterFoam/ImpactingDrop/Oldroyd-BLog/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(U)         Gauss linear;
    extSTGrad       Gauss linear;

}

divSchemes
{
    default                  none;
    div(Sum(tau))            Gauss linear; 
    div(grad(U))             Gauss linear;
    
    div(rho*phi,U)           GaussDefCmpw cubista; 
    
    div(phi,alpha)           Gauss vanLeer01;
    div(phirb,alpha)         Gauss linear;
    
    div(phi,theta1)     GaussDefCmpw cubista;
    div(phi,theta2)     GaussDefCmpw cubista;
    div(phi,tau1)       GaussDefCmpw cubista;
    div(phi,tau2)       GaussDefCmpw cubista;
    
}

laplacianSchemes
{
    default                             none;
    laplacian(eta,U)                    Gauss linear corrected;
    laplacian(p_rgh|(ap-H1))                Gauss linear corrected;
    laplacian((1|A(U)),pcorr)           Gauss linear corrected;
    laplacian(Dp,p_rgh)    		Gauss linear corrected;     
}

interpolationSchemes
{
    default        linear;      
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p_rgh;
    pcorr;
    alpha1;
}

// ************************************************************************* //
